### Pyspark Handling Missing Values
1) Dropping Columns
2) Dropping Rows
3) Various Parameter In Dropping functionalities
4) Handling Missing values by Mean, MEdian And Mode

In [1]:
from pyspark.sql import SparkSession

In [2]:
spark = SparkSession.builder.appName('Tutorial_3').getOrCreate()

In [3]:
spark

In [4]:
df_spark = spark.read.csv('DataSet2.csv', header=True, inferSchema=True)

In [5]:
df_spark.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
| Aayush|  24|         3| 25000|
| Tripti|  22|         1| 20000|
| Aditya|  25|         3| 30000|
| Shivam|  25|         1| 30000|
| Ashish|  25|         3| 28000|
| Naincy|  25|         2| 32000|
|Vaibhav|  26|         2| 35000|
| Preeti|  26|         5| 40000|
|Suruchi|  29|      NULL| 70000|
| Chirag|  26|         4| 90000|
| Anurag|NULL|        15|110000|
|   NULL|  34|      NULL|  NULL|
|   NULL|  36|      NULL|  NULL|
+-------+----+----------+------+

In [6]:
# drop columns
df_spark.drop('Salary').show()

+-------+----+----------+
|   Name| Age|Experience|
+-------+----+----------+
| Aayush|  24|         3|
| Tripti|  22|         1|
| Aditya|  25|         3|
| Shivam|  25|         1|
| Ashish|  25|         3|
| Naincy|  25|         2|
|Vaibhav|  26|         2|
| Preeti|  26|         5|
|Suruchi|  29|      NULL|
| Chirag|  26|         4|
| Anurag|NULL|        15|
|   NULL|  34|      NULL|
|   NULL|  36|      NULL|
+-------+----+----------+

In [9]:
# drop all rows wherever null is present
# df_spark.dropna().show()
df_spark.na.drop().show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
| Aayush| 24|         3| 25000|
| Tripti| 22|         1| 20000|
| Aditya| 25|         3| 30000|
| Shivam| 25|         1| 30000|
| Ashish| 25|         3| 28000|
| Naincy| 25|         2| 32000|
|Vaibhav| 26|         2| 35000|
| Preeti| 26|         5| 40000|
| Chirag| 26|         4| 90000|
+-------+---+----------+------+

In [15]:
# drop takes params as how , thresh and how
df_spark.na.drop(how='any').show() # drop if any of row has null values.
# df_spark.na.drop(how='all').show() # wherever all values are null, it'll drop that row.

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
| Aayush| 24|         3| 25000|
| Tripti| 22|         1| 20000|
| Aditya| 25|         3| 30000|
| Shivam| 25|         1| 30000|
| Ashish| 25|         3| 28000|
| Naincy| 25|         2| 32000|
|Vaibhav| 26|         2| 35000|
| Preeti| 26|         5| 40000|
| Chirag| 26|         4| 90000|
+-------+---+----------+------+

In [17]:
# Threshold
df_spark.na.drop(thresh=2).show() # drops where there is no atleast 2 non null values present

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
| Aayush|  24|         3| 25000|
| Tripti|  22|         1| 20000|
| Aditya|  25|         3| 30000|
| Shivam|  25|         1| 30000|
| Ashish|  25|         3| 28000|
| Naincy|  25|         2| 32000|
|Vaibhav|  26|         2| 35000|
| Preeti|  26|         5| 40000|
|Suruchi|  29|      NULL| 70000|
| Chirag|  26|         4| 90000|
| Anurag|NULL|        15|110000|
+-------+----+----------+------+

In [20]:
# Subset
df_spark.na.drop(how='any', subset=['Experience', 'Age']).show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
| Aayush| 24|         3| 25000|
| Tripti| 22|         1| 20000|
| Aditya| 25|         3| 30000|
| Shivam| 25|         1| 30000|
| Ashish| 25|         3| 28000|
| Naincy| 25|         2| 32000|
|Vaibhav| 26|         2| 35000|
| Preeti| 26|         5| 40000|
| Chirag| 26|         4| 90000|
+-------+---+----------+------+

In [ ]:
# sort based on column
df_spark.sort('Name').show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|   NULL|  34|      NULL|  NULL|
|   NULL|  36|      NULL|  NULL|
| Aayush|  24|         3| 25000|
| Aditya|  25|         3| 30000|
| Anurag|NULL|        15|110000|
| Ashish|  25|         3| 28000|
| Chirag|  26|         4| 90000|
| Naincy|  25|         2| 32000|
| Preeti|  26|         5| 40000|
| Shivam|  25|         1| 30000|
|Suruchi|  29|      NULL| 70000|
| Tripti|  22|         1| 20000|
|Vaibhav|  26|         2| 35000|
+-------+----+----------+------+

In [33]:
# filling the missing values
# df_spark.na.fill('0').show()
# df_spark.na.fill(0, ['Experience', 'Age']).show()
df_spark.na.fill({'Name': '0', 'Age': 0, 'Experience': 0, 'Salary': 0}).show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
| Aayush| 24|         3| 25000|
| Tripti| 22|         1| 20000|
| Aditya| 25|         3| 30000|
| Shivam| 25|         1| 30000|
| Ashish| 25|         3| 28000|
| Naincy| 25|         2| 32000|
|Vaibhav| 26|         2| 35000|
| Preeti| 26|         5| 40000|
|Suruchi| 29|         0| 70000|
| Chirag| 26|         4| 90000|
| Anurag|  0|        15|110000|
|      0| 34|         0|     0|
|      0| 36|         0|     0|
+-------+---+----------+------+

In [37]:
from pyspark.ml.feature import Imputer

In [39]:
# original df
df_spark.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
| Aayush|  24|         3| 25000|
| Tripti|  22|         1| 20000|
| Aditya|  25|         3| 30000|
| Shivam|  25|         1| 30000|
| Ashish|  25|         3| 28000|
| Naincy|  25|         2| 32000|
|Vaibhav|  26|         2| 35000|
| Preeti|  26|         5| 40000|
|Suruchi|  29|      NULL| 70000|
| Chirag|  26|         4| 90000|
| Anurag|NULL|        15|110000|
|   NULL|  34|      NULL|  NULL|
|   NULL|  36|      NULL|  NULL|
+-------+----+----------+------+

In [ ]:
imputer = Imputer(
    inputCols=['Age', 'Experience', 'Salary'],
    outputCols=["{}_imputed".format(c) for c in ['Age', 'Experience', 'Salary']], #strategy='mean'
).setStrategy("mean")

In [44]:
imputed_df = imputer.fit(df_spark).transform(df_spark).show()

+-------+----+----------+------+-----------+------------------+--------------+
|   Name| Age|Experience|Salary|Age_imputed|Experience_imputed|Salary_imputed|
+-------+----+----------+------+-----------+------------------+--------------+
| Aayush|  24|         3| 25000|         24|                 3|         25000|
| Tripti|  22|         1| 20000|         22|                 1|         20000|
| Aditya|  25|         3| 30000|         25|                 3|         30000|
| Shivam|  25|         1| 30000|         25|                 1|         30000|
| Ashish|  25|         3| 28000|         25|                 3|         28000|
| Naincy|  25|         2| 32000|         25|                 2|         32000|
|Vaibhav|  26|         2| 35000|         26|                 2|         35000|
| Preeti|  26|         5| 40000|         26|                 5|         40000|
|Suruchi|  29|      NULL| 70000|         29|                 3|         70000|
| Chirag|  26|         4| 90000|         26|                 4|         90000|
| Anurag|NULL|        15|110000|         26|                15|        110000|
|   NULL|  34|      NULL|  NULL|         34|                 3|         46363|
|   NULL|  36|      NULL|  NULL|         36|                 3|         46363|
+-------+----+----------+------+-----------+------------------+--------------+